app/controllers/admin_controller.rb

def index

  if session[:user_id].nil?

    flash[:error] = "Please login."
    redirect '/'

  else

    @user=User.find_by_id(session[:user_id])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1 LIMIT 1

def updateuser

<<<<<<< HEAD
  u=User.find_by_id(session[:user_id])

  u.username= params[:user][:username]
  u.email=params[:user][:email]
=======
  #u=User.find_by_id(session[:user_id]

  #u.username= params[:user][:username]
  #u.email=params[:user][:email]
>>>>>>> 41c4080cf0eec91f54f90a650f2f0ec856d77541
  #u.startwork= params[:user][:startwork]
  #u.endwork= params[:user][:endwork]
  #u.lunchstart= params[:user][:lunchstart]
  #u.lunchlength= params[:user][:lunchlength]
  #u.dailyemails=params[:user][:dailyemails]
<<<<<<< HEAD
  u.save

  flash[:success] = "Your details have been updated."

  redirect_to useradmin_path
=======
  #u.save

  #flash[:success] = "Your details have been updated."
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `endwork` = '2000-01-01 17:30:00', `lunchlength` = 1.0, `lunchstart` = '2000-01-01 13:00:00', `password_hash` = '$2a$10$FOcF4iSQPNp4yGxTH3sHGe1JZ12/dW8I18J6pjeZAp7kPWp7bEadu', `password_salt` = '$2a$10$FOcF4iSQPNp4yGxTH3sHGe', `startwork` = '2000-01-01 08:30:00', `updated_at` = '2015-02-27 20:44:28' WHERE `users`.`id` = 2