app/controllers/projects_controller.rb

  def index

    if session[:user_id].nil?

      redirect_to '/'

    else

      @projects = Todo.select("todo_project, max(todo_deadline) as project_deadline, sum(if(todo_complete=true,0,1)) as todo_item_count, round(sum(if(todo_complete=true,0,todo_timeremaining)),2) as time_remaining, 100-round(sum(if(todo_complete=true,0,todo_timeremaining))*100/sum(todo_timerequired),0) as percentage_complete").where("todo_project is not null and todo_project !='' AND user_id = ?", session[:user_id]).group("todo_project")
---
SELECT todo_project, max(todo_deadline) as project_deadline, sum(if(todo_complete=true,0,1)) as todo_item_count, round(sum(if(todo_complete=true,0,todo_timeremaining)),2) as time_remaining, 100-round(sum(if(todo_complete=true,0,todo_timeremaining))*100/sum(if((latestrecur=true or latestrecur is null),todo_timerequired,0)),0) as percentage_complete FROM `todos`  WHERE (latestrecur=true and todo_project is not null and todo_project !='' AND user_id = 2) GROUP BY todo_project HAVING sum(if(todo_complete=true,0,1)) > 0

  def projectdetails

    @project_todos = Todo.where("todo_project = ? AND user_id = ?", params[:project],session[:user_id]).order("todo_deadline ASC, todo_item ASC")
    @new_todo = Todo.new

    if @project_todos.count == 0
---
SELECT `todos`.* FROM `todos`  WHERE (todo_project = 'Todo List' AND user_id = 2 AND (latestrecur=true or latestrecur is null))  ORDER BY todo_complete ASC, todo_deadline ASC, todo_item ASC
SELECT COUNT(*) FROM `todos`  WHERE (todo_project = 'Todo List' AND user_id = 2 AND (latestrecur=true or latestrecur is null))