app/controllers/todos_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 5 LIMIT 1
SELECT `todos`.* FROM `todos`  WHERE (user_id = 5) AND (todos.todo_category<>'Personal' AND todo_urgence>0 AND (todo_urgence >= 11 OR DATE(todo_deadline) = curdate()))  ORDER BY todo_complete ASC, (todo_urgence + todo_importance) DESC, todo_item ASC
UPDATE `todos` SET `todos`.`todo_urgence` = 0 WHERE (todo_complete is true AND todo_deadline < curdate() and user_id = 1)
---
  def index

    if session[:user_id].nil?

      redirect_to '/'

    else

      session[:return_route] = index_path
      @user=User.find_by_id(session[:user_id])
      Todo.connection.execute("UPDATE todos set todos.todo_urgence = if(10/((todos.todo_deadline - now()) - todos.todo_timeremaining/8)<0,11,10/((todos.todo_deadline - now()) - todos.todo_timeremaining/8)) WHERE todos.todo_complete = false or todos.todo_complete is null")
      Todo.where("todo_urgence < 0 and user_id = ?", session[:user_id]).update_all todo_urgence: 11

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 5 LIMIT 1
INSERT INTO `todos` (`created_at`, `todo_complete`, `todo_deadline`, `todo_item`, `todo_project`, `updated_at`, `user_id`) VALUES ('2015-02-25 06:20:17', 0, '2015-02-25', 'Add a datepicker', 'Todo List', '2015-02-25 06:20:17', 2)
---
  def add

    u=User.find_by_id(session[:user_id])
    d=Date.today
    if u.endwork.nil?
	dt=Time.new(d.year,d.month,d.day,17,0,0)
    else
	t=u.endwork
        dt=Time.new(d.year,d.month,d.day,t.hour,t.min,t.sec)
    end

    todo = Todo.create(:todo_item => params[:todo][:todo_item], :user_id => session[:user_id], :todo_project => params[:todo][:todo_project], :todo_deadline => dt, :todo_complete => false)

SELECT  `todos`.* FROM `todos`  WHERE `todos`.`id` = 3 LIMIT 1
DELETE FROM `todos` WHERE `todos`.`id` = 3
---
  def delete

    if Todo.allowview(params[:id], session[:user_id]).nil?

      flash[:error]="Invalid To Do"
      redirect_to index_path

    else

      t = Todo.find_by_id(params[:id])
      t.delete

SELECT  `todos`.* FROM `todos`  WHERE `todos`.`id` = 6 LIMIT 1
---
  def complete

    if params['complete_todo']

      unless params[:todos_checkbox].nil?

      params[:todos_checkbox].each do |check|

        todo_id = check

        t=Todo.find_by_id(todo_id)

UPDATE `todos` SET `todo_status` = 0.5, `todo_timeremaining` = 0.5, `updated_at` = '2015-03-03 07:19:44' WHERE `todos`.`id` = 8
---

        t.todo_complete = !t.todo_complete

        t.save

SELECT  `todos`.* FROM `todos`  WHERE `todos`.`id` = 1 LIMIT 1
---
  def details

    @new_todo = Todo.new

    if Todo.allowview(params[:id], session[:user_id]).nil?

      flash[:error]="Invalid To Do"
      redirect_to index_path

    else

      @details_todo = Todo.find_by_id(params[:id])

SELECT  `todos`.* FROM `todos`  WHERE `todos`.`id` = 1 LIMIT 1
---
  def updatetodo

    t = Todo.find_by_id(params[:todo][:todo_id])