app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `password_hash`, `password_salt`, `updated_at`, `username`) VALUES ('2015-02-24 06:18:55', 'test@test.test', '$2a$10$yYzKUPQf37u2tzhfwQlU4urIXd3gBO1hVRGZvkFNkuC81aH.FBWzi', '$2a$10$yYzKUPQf37u2tzhfwQlU4u', '2015-02-24 06:18:55', 'test')
---
def create

	@user = User.new(user_params)
	if @user.save